In [24]:
import pandas as pd

## **Data Manipulation**
Here we will see what type of method we can perform which will help us to make data more clean and how to use that data for future for eda or feature enginering

In [25]:
# lets import the csv to make df out of it 
df = pd.read_csv('./data.csv')
print(df)

          Date Category  Value   Product  Sales Region
0   2023-01-01        A   28.0  Product1  754.0   East
1   2023-01-02        B   39.0  Product3  110.0  North
2   2023-01-03        C   32.0  Product2  398.0   East
3   2023-01-04        B    8.0  Product1  522.0   East
4   2023-01-05        B   26.0  Product3  869.0  North
5   2023-01-06        B   54.0  Product3  192.0   West
6   2023-01-07        A   16.0  Product1  936.0   East
7   2023-01-08        C   89.0  Product1  488.0   West
8   2023-01-09        C   37.0  Product3  772.0   West
9   2023-01-10        A   22.0  Product2  834.0   West
10  2023-01-11        B    7.0  Product1  842.0  North
11  2023-01-12        B   60.0  Product2    NaN   West
12  2023-01-13        A   70.0  Product3  628.0  South
13  2023-01-14        A   69.0  Product1  423.0   East
14  2023-01-15        A   47.0  Product2  893.0   West
15  2023-01-16        C    NaN  Product1  895.0  North
16  2023-01-17        C   93.0  Product2  511.0  South
17  2023-01-18        C    NaN  Product1  108.0   West
18  2023-01-19        A   31.0  Product2  578.0   West
19  2023-01-20        A   59.0  Product1  736.0   East
20  2023-01-21        C   82.0  Product3  606.0  South
21  2023-01-22        C   37.0  Product2  992.0  South
22  2023-01-23        B   62.0  Product3  942.0  North
23  2023-01-24        C   92.0  Product2  342.0   West
24  2023-01-25        A   24.0  Product2  458.0   East
25  2023-01-26        C   95.0  Product1  584.0   West
26  2023-01-27        C   71.0  Product2  619.0  North
27  2023-01-28        C   56.0  Product2  224.0  North
28  2023-01-29        B    NaN  Product3  617.0  North
29  2023-01-30        C   51.0  Product2  737.0  South
30  2023-01-31        B   50.0  Product3  735.0   West
31  2023-02-01        A   17.0  Product2  189.0   West
32  2023-02-02        B   63.0  Product3  338.0  South
33  2023-02-03        C   27.0  Product3    NaN   East
34  2023-02-04        C   70.0  Product3  669.0   West
35  2023-02-05        B   60.0  Product2    NaN   West
36  2023-02-06        C   36.0  Product3  177.0   East
37  2023-02-07        C    2.0  Product1    NaN  North
38  2023-02-08        C   94.0  Product1  408.0  South
39  2023-02-09        A   62.0  Product1  155.0   West
40  2023-02-10        B   15.0  Product1  578.0   East
41  2023-02-11        C   97.0  Product1  256.0   East
42  2023-02-12        A   93.0  Product3  164.0   West
43  2023-02-13        A   43.0  Product3  949.0   East
44  2023-02-14        A   96.0  Product3  830.0   East
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [26]:
# print first 5 element with head and last 5 element with tail
# here we can also provide the parameter as the number of rows we need to print from the csv file
print(df.head())
print(df.tail())

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North
          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [27]:
# describe will give the statistical measures of the data will be there it will not count the categorical data
df.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [28]:
# dtypes will allow us to find the datatype of each column 
df.dtypes

Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

In [29]:
## Handling missing values 

# first find the missing value with the help of the isnull function if the bool is false then no missing value over ther and vice versa 
print(df.isnull(),end='\n') # by this we can see there are few places which have missing value lets handle those missing values 
# another way to find it is using any functino 
print(df.isnull().any(),end='\n')
print(df.isnull().any(axis=1),end='\n')

print(df.isnull().sum(),'\n') # this will give the total null values in each column

     Date  Category  Value  Product  Sales  Region
0   False     False  False    False  False   False
1   False     False  False    False  False   False
2   False     False  False    False  False   False
3   False     False  False    False  False   False
4   False     False  False    False  False   False
5   False     False  False    False  False   False
6   False     False  False    False  False   False
7   False     False  False    False  False   False
8   False     False  False    False  False   False
9   False     False  False    False  False   False
10  False     False  False    False  False   False
11  False     False  False    False   True   False
12  False     False  False    False  False   False
13  False     False  False    False  False   False
14  False     False  False    False  False   False
15  False     False   True    False  False   False
16  False     False  False    False  False   False
17  False     False   True    False  False   False
18  False     False  False    False  False   False
19  False     False  False    False  False   False
20  False     False  False    False  False   False
21  False     False  False    False  False   False
22  False     False  False    False  False   False
23  False     False  False    False  False   False
24  False     False  False    False  False   False
25  False     False  False    False  False   False
26  False     False  False    False  False   False
27  False     False  False    False  False   False
28  False     False   True    False  False   False
29  False     False  False    False  False   False
30  False     False  False    False  False   False
31  False     False  False    False  False   False
32  False     False  False    False  False   False
33  False     False  False    False   True   False
34  False     False  False    False  False   False
35  False     False  False    False   True   False
36  False     False  False    False  False   False
37  False     False  False    False   True   False
38  False     False  False    False  False   False
39  False     False  False    False  False   False
40  False     False  False    False  False   False
41  False     False  False    False  False   False
42  False     False  False    False  False   False
43  False     False  False    False  False   False
44  False     False  False    False  False   False
45  False     False  False    False  False   False
46  False     False  False    False  False   False
47  False     False  False    False  False   False
48  False     False  False    False  False   False
49  False     False  False    False  False   False
Date        False
Category    False
Value        True
Product     False
Sales        True
Region      False
dtype: bool
0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
12    False
13    False
14    False
15     True
16    False
17     True
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28     True
29    False
30    False
31    False
32    False
33     True
34    False
35     True
36    False
37     True
38    False
39    False
40    False
41    False
42    False
43    False
44    False
45    False
46    False
47    False
48    False
49    False
dtype: bool
Date        0
Category    0
Value       3
Product     0
Sales       4
Region      0
dtype: int64

In [30]:
## how to fill the missing values with differnet value 
# fill the nan value with some value of our choice 
df_filled = df.fillna(0)
df_filled.head(15)

          Date Category  Value   Product  Sales Region
0   2023-01-01        A   28.0  Product1  754.0   East
1   2023-01-02        B   39.0  Product3  110.0  North
2   2023-01-03        C   32.0  Product2  398.0   East
3   2023-01-04        B    8.0  Product1  522.0   East
4   2023-01-05        B   26.0  Product3  869.0  North
5   2023-01-06        B   54.0  Product3  192.0   West
6   2023-01-07        A   16.0  Product1  936.0   East
7   2023-01-08        C   89.0  Product1  488.0   West
8   2023-01-09        C   37.0  Product3  772.0   West
9   2023-01-10        A   22.0  Product2  834.0   West
10  2023-01-11        B    7.0  Product1  842.0  North
11  2023-01-12        B   60.0  Product2    0.0   West
12  2023-01-13        A   70.0  Product3  628.0  South
13  2023-01-14        A   69.0  Product1  423.0   East
14  2023-01-15        A   47.0  Product2  893.0   West

In [31]:
# filling missing values with the mean of that cloumn 
df['Sales_filledna'] = df['Sales'].fillna(df['Sales'].mean())
df.head(20)

          Date Category  Value   Product  Sales Region  Sales_filledna
0   2023-01-01        A   28.0  Product1  754.0   East      754.000000
1   2023-01-02        B   39.0  Product3  110.0  North      110.000000
2   2023-01-03        C   32.0  Product2  398.0   East      398.000000
3   2023-01-04        B    8.0  Product1  522.0   East      522.000000
4   2023-01-05        B   26.0  Product3  869.0  North      869.000000
5   2023-01-06        B   54.0  Product3  192.0   West      192.000000
6   2023-01-07        A   16.0  Product1  936.0   East      936.000000
7   2023-01-08        C   89.0  Product1  488.0   West      488.000000
8   2023-01-09        C   37.0  Product3  772.0   West      772.000000
9   2023-01-10        A   22.0  Product2  834.0   West      834.000000
10  2023-01-11        B    7.0  Product1  842.0  North      842.000000
11  2023-01-12        B   60.0  Product2    NaN   West      557.130435
12  2023-01-13        A   70.0  Product3  628.0  South      628.000000
13  2023-01-14        A   69.0  Product1  423.0   East      423.000000
14  2023-01-15        A   47.0  Product2  893.0   West      893.000000
15  2023-01-16        C    NaN  Product1  895.0  North      895.000000
16  2023-01-17        C   93.0  Product2  511.0  South      511.000000
17  2023-01-18        C    NaN  Product1  108.0   West      108.000000
18  2023-01-19        A   31.0  Product2  578.0   West      578.000000
19  2023-01-20        A   59.0  Product1  736.0   East      736.000000

In [34]:
## Renaming a column we have rename functin to do this we need to provde it in the key:value pair to it with old_name:new_name
df.rename(columns={'Date':'Sales Date'},inplace=True)
df.head()

   Sales Date Category  Value   Product  Sales Region  Sales_filledna
0  2023-01-01        A   28.0  Product1  754.0   East           754.0
1  2023-01-02        B   39.0  Product3  110.0  North           110.0
2  2023-01-03        C   32.0  Product2  398.0   East           398.0
3  2023-01-04        B    8.0  Product1  522.0   East           522.0
4  2023-01-05        B   26.0  Product3  869.0  North           869.0

In [36]:
## Change the datatype of the column
df['value_new']= df['Value'].fillna(df['Value'].mean()).astype(int)
df.head()

,Sales Date,Category,Value,Product,Sales,Region,Sales_filledna,value_new
0,2023-01-01,A,28.0,Product1,754.0,East,754.0,28
1,2023-01-02,B,39.0,Product3,110.0,North,110.0,39
2,2023-01-03,C,32.0,Product2,398.0,East,398.0,32
3,2023-01-04,B,8.0,Product1,522.0,East,522.0,8
4,2023-01-05,B,26.0,Product3,869.0,North,869.0,26

In [38]:
## using apply functino which can take function like user or inbuilt or lambda function which will be helped to do opoerations on the column or at row level but preferable to do on column 

df['value_new'] = df['value_new'].apply(lambda x:x*2)
df.head()

,Sales Date,Category,Value,Product,Sales,Region,Sales_filledna,value_new
0,2023-01-01,A,28.0,Product1,754.0,East,754.0,56
1,2023-01-02,B,39.0,Product3,110.0,North,110.0,78
2,2023-01-03,C,32.0,Product2,398.0,East,398.0,64
3,2023-01-04,B,8.0,Product1,522.0,East,522.0,16
4,2023-01-05,B,26.0,Product3,869.0,North,869.0,52

#### **Data Aggregating and Grouping**

In [45]:
## Data aggreagationg

# group by using one categorical column
grouped_mean = df.groupby('Product')['Value'].mean()
print(grouped_mean)

# with 2 categorical variable 
grouped_sum = df.groupby(['Product','Region'])['Value'].sum()
print(grouped_sum)
grouped_mean = df.groupby(['Product','Region'])['Value'].mean()
print(grouped_mean)

# aggreagte multiple function
grouped_agg = df.groupby('Region')['Value'].agg(['mean','min','sum','count'])
print(grouped_agg)

Product
Product1    46.214286
Product2    52.800000
Product3    55.166667
Name: Value, dtype: float64
Product   Region
Product1  East      292.0
          North       9.0
          South     100.0
          West      246.0
Product2  East       56.0
          North     127.0
          South     181.0
          West      428.0
Product3  East      202.0
          North     203.0
          South     215.0
          West      373.0
Name: Value, dtype: float64
Product   Region
Product1  East      41.714286
          North      4.500000
          South     50.000000
          West      82.000000
Product2  East      28.000000
          North     63.500000
          South     60.333333
          West      53.500000
Product3  East      50.500000
          North     40.600000
          South     71.666667
          West      62.166667
Name: Value, dtype: float64
             mean   min     sum  count
Region
East    42.307692   8.0   550.0     13
North   37.666667   2.0   339.0      9
South   62.000000   6.0   496.0      8
West    61.588235  17.0  1047.0     17

#### **Merging and joining Dataframe**

In [49]:
# Creating DataFrames
left_df = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})

right_df = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K4'],
                      'C': ['C0', 'C1', 'C2', 'C4'],
                      'D': ['D0', 'D1', 'D2', 'D4']})

In [ ]:
# Merging DataFrames on key column
result = pd.merge(left_df, right_df, on='key')
print(result)

# Different types of merges
# Inner join
result = pd.merge(left_df, right_df, on='key', how='inner')
print(result)

# Outer join
result = pd.merge(left_df, right_df, on='key', how='outer')
print(result)

# left join
result = pd.merge(left_df, right_df, on='key', how='left')
print(result)

# Right join
result = pd.merge(left_df, right_df, on='key', how='right')
print(result)

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K1   A1   B1   C1   D1
2  K2   A2   B2   C2   D2
3  K3   A3   B3  NaN  NaN
4  K4  NaN  NaN   C4   D4
  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K1  A1  B1   C1   D1
2  K2  A2  B2   C2   D2
3  K3  A3  B3  NaN  NaN
  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1   A1   B1  C1  D1
2  K2   A2   B2  C2  D2
3  K4  NaN  NaN  C4  D4